 gcc -g p7final.c 
p7final.c: In function ‘input_complex’:
p7final.c:12:11: warning: format ‘%d’ expects argument of type ‘int *’, but argument 2 has type ‘double’ [-Wformat=]
   scanf("%d%d", comp.real, comp.imaginary);
          ~^     ~~~~~~~~~
p7final.c:12:13: warning: format ‘%d’ expects argument of type ‘int *’, but argument 3 has type ‘double’ [-Wformat=]
   scanf("%d%d", comp.real, comp.imaginary);
            ~^              ~~~~~~~~~~~~~~
p7final.c: In function ‘output’:
p7final.c:26:12: warning: format ‘%d’ expects argument of type ‘int’, but argument 2 has type ‘double’ [-Wformat=]
   printf("%d + %di + %d + %di is %d + %di\n", a.real, a.imaginary, b.real, b.imaginary, res.real, res.imaginary);
           ~^                                  ~~~~~~
           %f
p7final.c:26:17: warning: format ‘%d’ expects argument of type ‘int’, but argument 3 has type ‘double’ [-Wformat=]
   printf("%d + %di + %d + %di is %d + %di\n", a.real, a.imaginary, b.real, b.imaginary, res.real, res.imaginary);
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x87c: file p7final.c, line 31.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7final.c:31
31    Complex num1 = input_complex();
(gdb) s
input_complex () at p7final.c:9
9   {
(gdb) n
11    printf("Enter the real and imaginary part of complex number separated by a space or linebreak:\n");
(gdb) 
Enter the real and imaginary part of complex number separated by a space or linebreak:
12    scanf("%f%f", &comp.real, &comp.imaginary);
(gdb) 
4 5
13    return comp;
(gdb) p comp
$1 = {real = 4, imaginary = 5}
(gdb) n
14  }
(gdb) 
main () at p7final.c:32
32    Complex num2 = input_complex();
(gdb) n
Enter the real and imaginary part of complex number separated by a space or linebreak:
8 7
33    Complex sum = add(num1, num2);
(gdb) p num2
$2 = {real = 8, imaginary = 7}
(gdb) s
add (a=..., b=...) at p7final.c:19
19    sum.real = a.real + b.real;
(gdb) n
20    sum.imaginary = a.imaginary + b.imaginary;
(gdb) 
21    return sum;
(gdb) 
22  }
(gdb) 
main () at p7final.c:34
34    output(num1, num2, sum);
(gdb) p sum
$3 = {real = 12, imaginary = 12}
(gdb) s
output (a=..., b=..., res=...) at p7final.c:26
26    printf("%0.1f + %0.1fi + %0.1f + %0.1fi is %0.1f + %0.1fi\n", a.real, a.imaginary, b.real, b.imaginary, res.real, res.imaginary);
(gdb) n
4.0 + 5.0i + 8.0 + 7.0i is 12.0 + 12.0i
27  }
(gdb) 
main () at p7final.c:35
35    return 0;
(gdb) c
Continuing.
[Inferior 1 (process 1157) exited normally]